# CanHaveStructuralSection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..CanHaveStructuralSection Method
Family Class See Also
---
Identifies if this Family can have a structural section.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool CanHaveStructuralSection()
```

Visual Basic
---
```text
Public Function CanHaveStructuralSection As Boolean
```

Visual C++
---
```text
public:
bool CanHaveStructuralSection()
```

# ### Return Value
True if the Family can have structural section, false otherwise.
# See Also
Family Class
Autodesk.Revit.DB Namespace